Step 1 - Start Erlang and compile the Erlang code:

unix> erl
Erlang (BEAM) emulator version 4.9.1.2

Eshell V4.9.1.2 (abort with ^G)
1> c(complex1).
{ok,complex1}

Step 2 - Run the example:

2> complex1:start("node index.js").
<0.34.0>
3> complex1:foo().
"foo from node".
4> complex1:bar().
"bar from node".
5> complex1:stop().
stop

